## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.cluster-issuer will be updated in-place
!   resource "helm_release" "cluster-issuer" {
        id                         = "cluster-issuer"
        name                       = "cluster-issuer"
!       version                    = "0.2.0" -> "0.2.1"
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # kubernetes_namespace.cert-manager will be updated in-place
!   resource "kubernetes_namespace" "cert-manager" {
        id = "cert-manager"

!       metadata {
!           labels           = {
+               "istio.io/rev" = "asm-managed-regular"
            }
            name             = "cert-manager"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.cloud-dns-credentials will be created
+   resource "kubernetes_secret" "cloud-dns-credentials" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "clouddns-account"
+           namespace        = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 248.11 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 248.11 | 248.11|
| | **Total** | **0.00** | **248.11** | **248.11** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
